[M_HiddenJournals MissionDefinition]
TurnInDescription="You retrieved Tannis's journals, learning quite a lot about nosebleeds in the process."
MissionSummary="Find Patricia Tannis's lost journals."
